# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# Ultralytics YOLO11 with Lightweight GERF-BRA (Faster Training)
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n head with Lightweight GERF-BRA (only on P4 for speed)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 13
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 16 (P3/8-small)
  
  - [-1, 1, Conv, [256, 3, 2]] # 17
  - [[-1, 13], 1, Concat, [1]] # 18 - cat head P4
  - [-1, 2, C3k2, [512, False]] # 19 (P4/16-medium)
  
  # GERF-BRA enhancement only on P4 (most important for speed/accuracy tradeoff)
  - [-1, 1, Conv, [512, 1, 1]] # 20 - channel adjustment
  - [-1, 1, GERF_BRA_Simple, [512]] # 21 - Simplified GERF-BRA
  - [-1, 1, Conv, [512, 1, 1]] # 22 - output adjustment
  
  - [-1, 1, Conv, [512, 3, 2]] # 23
  - [[-1, 10], 1, Concat, [1]] # 24 - cat head P5
  - [-1, 2, C3k2, [1024, True]] # 25 (P5/32-large)
  
  - [[16, 22, 25], 1, Detect, [nc]] # 26 - Detect(P3, P4, P5)